{"He wondered if cutting his hair was something he would ever do again. Going home was more complicated than it first seemed.":[{"content":"I can remember walking around the old neighborhood wondering what water temperature would be best for washing my hair. I also thought about whether or not I would ever have it cut again. It had grown quite long while I was in school and coming back to the neighborhood after almost four years was awkward for me to say the least. I needed to find a job quick. Living in that old house again on Royal Palm Avenue with my mother wasn't an option. I wouldn't have been able to handle that for very long and as it turned out, I didn't have to. Nor did I cut my hair.","parent":"posts/looking back.md","score":0.882634859109256},{"content":"find your way back home","parent":"posts/rain never lies.md","score":0.8202845015387851},{"content":"Coming to, coasting through spaces between trees, he recovers unscathed, living to tell the story 50 years later.","parent":"posts/glimpstory.md","score":0.8123970190438283},{"content":"The thing about repressed memories is that they never really go away.","parent":"posts/shatters.md","score":0.8094194302080193},{"content":"There’s a number of other pleasant memories since then through the next 5 years or so but many moments in my youth thereafter were destined to become repressed memories as an adult.","parent":"posts/shatters.md","score":0.8077670112067878},{"content":"It was an old step van and the passenger seat wasn’t anchored. As my father drove, the seat slid forward then back then forward again. What a ride! I’m [guessing](shatters.md) I was about 10 or 11-years-old then based on the fact that Tony was with us in the van. He was a guy my father helped to immigrate from Cuba (in 1959?). We were on the way to [the bay](the%20bay.md).","parent":"posts/freeform 09-28-21.md","score":0.8030568990917799},{"content":"I want to deal with what’s possible, not wallow is what’s already taken place and left its ugly mark.","parent":"posts/chasing thought.md","score":0.8010820074216846}]}