{"We lived above the sub shop. My parents had opened one of area’s first, specializing in [Italian subs](sub.md), Philly steak sandwiches, Sicilian pizza, and other goodies. It’s not surprising I was a fat little kid back then.":[{"content":"We lived above the sub shop. My parents had opened one of area’s first, specializing in [Italian subs](sub.md), Philly steak sandwiches, Sicilian pizza, and other goodies. It’s not surprising I was a fat little kid back then.","parent":"posts/above the sub shop.md","score":1},{"content":"To be honest, I’m not sure if it was the Delaware Bay or the Chesapeake Bay but Tony and my father had these huge cages for catching crabs and we’d return [home](above%20the%20sub%20shop.md) with bushels of ’em.","parent":"posts/the bay.md","score":0.8329951717092278},{"content":"It was an old step van and the passenger seat wasn’t anchored. As my father drove, the seat slid forward then back then forward again. What a ride! I’m [guessing](shatters.md) I was about 10 or 11-years-old then based on the fact that Tony was with us in the van. He was a guy my father helped to immigrate from Cuba (in 1959?). We were on the way to [the bay](the%20bay.md).","parent":"posts/freeform 09-28-21.md","score":0.8318032564355001},{"content":"I can remember walking around the old neighborhood wondering what water temperature would be best for washing my hair. I also thought about whether or not I would ever have it cut again. It had grown quite long while I was in school and coming back to the neighborhood after almost four years was awkward for me to say the least. I needed to find a job quick. Living in that old house again on Royal Palm Avenue with my mother wasn't an option. I wouldn't have been able to handle that for very long and as it turned out, I didn't have to. Nor did I cut my hair.","parent":"posts/looking back.md","score":0.8273954522393511},{"content":"![](https://ideas.joejenett.com/images/goodstart.png)","parent":"posts/sub.md","score":0.8171698884603785},{"content":"Decades ago, I was one of the giggling twins standing and jumping up and down on the passenger seat next to our mother who was driving the little Nash Rambler. I think we were about 3 years old at the time and this is the earliest memory I’ve managed to retain over the years.","parent":"posts/shatters.md","score":0.8106701068467594},{"content":"I came to know","parent":"posts/need.md","score":0.8098780643810104},{"content":"There’s a number of other pleasant memories since then through the next 5 years or so but many moments in my youth thereafter were destined to become repressed memories as an adult.","parent":"posts/shatters.md","score":0.8055405085687808},{"content":"[harmony](posts/harmony.md)","parent":"posts/need.md","score":0.8035412946216604}]}