{"It's all confusing and complicated. We have this medium with the potential to give everyone a voice but it's dominated by a handful of corporate giants. If we don't play the game on one their fields, our chances of being heard by anyone beyond our immediate circle of (real) friends are slim. The giants are drawing in the masses along with their personal data. The giants own the 'mainstream' and reap its financial rewards. Everyone has a voice - they just don't own it.":[{"content":"In my life and especially on the web, I have this thing about keeping the personal and commercial stuff separate. Like anyone, I have a business side. No one can survive without taking care of business.","parent":"posts/just me.md","score":0.8365920629876963},{"content":"it dawns on me that the caps were killed by a new medium that understood the lack of structure in peoples’ minds helplessly hoping for something new helplessly lost in the din of the same old thing being said over and over and over again in new and different ways","parent":"posts/‘webstream’ revisited.md","score":0.8254295189698989},{"content":"I see the web becoming a network of personal empires. In our own dominions, we say what needs to be said and share what we want to share. Here I am, glad to seen so many people...so many empires.","parent":"posts/empires.md","score":0.8232769623765362},{"content":"Be inquisitive. Know what you don't know.","parent":"posts/sanity 2.md","score":0.8159108921019751},{"content":"surely the web is people","parent":"posts/makers.md","score":0.8151311426515462},{"content":"“**Share what you enjoy or what you're curious about.** Not everyone will enjoy of it, some people will appreciate different things, but build friendships on mutual interests. **Don't be afraid to say you don't know something. Being forthright and asking for help is an admirable quality.**”","parent":"posts/help.md","score":0.8112906186505253},{"content":"we buy we try we fly to new places which look just like where we came from and offer no new answers click fast don’t stay don’t read don’t play just keep moving on to the next pointless wealth of information that we don’t really care about anyway we’re so cool for fools we’re so empty that we’re always longing to be full","parent":"posts/‘webstream’ revisited.md","score":0.8099173830974811},{"content":"intelligence of the rest of the _American people_. It's understandable that the so-called base","parent":"posts/we all hurt.md","score":0.8012500967531138},{"content":"be so close-minded?","parent":"posts/wonder.md","score":0.8009564992369934},{"content":"So I just finished reading an article about the downside of advertising. I agreed with much of what it said until I came to the money shot. A simple text link led to the author's other side - a site selling various professional services. He went on to say that his form of advertising was a better form than *advertising.* Though I actually agree, it’s still advertising. It’s commercial, not personal. co","parent":"posts/just me.md","score":0.8000724036403045}]}