{"Again, the worst happened and we're stuck with now and resilience is in order. ":[{"content":"we can move forward","parent":"posts/starting point.md","score":0.861500900846988},{"content":"unfortunate outcomes","parent":"posts/jump1.md","score":0.8519440062906736},{"content":"in depressing times","parent":"posts/rain never lies.md","score":0.8505873611737683},{"content":"Some stops in the journey border on unbearable but a new world is always just around the corner and when we’re lucky, it’s a better place.","parent":"posts/time and place.md","score":0.8370243819597769},{"content":"we need to let go","parent":"posts/let go.md","score":0.8366072005648326},{"content":"The long road flies by us as rain hits the hood of the old Ford.  What could we do but go along with this plan?  One day we'll grow up and do our own running.  One day we'll grow up and regress just like she has.","parent":"posts/running.md","score":0.8334206786709738},{"content":"- so here we go","parent":"posts/create-1.md","score":0.8219278236614561},{"content":"doesn't want to be wrong but the fact is they made a bad choice and our country is going to shit","parent":"posts/we all hurt.md","score":0.8218884389570048},{"content":"helplessly hoping to free myself of this load helplessly grabbing for the next winning number in the stream of addiction the next spinning thunder in the noise of the same old thing over and over and over again","parent":"posts/‘webstream’ revisited.md","score":0.820147485172401},{"content":"a lottery window in the middle of poverty seems right somehow i forgot what it was like to be cold and hungry luck like ours is hard to come by days turning into night unfulfilled","parent":"posts/stop-making-sense-part-one.md","score":0.8194964228826547},{"content":"Saying more about that now just adds to the noise, so let’s move on. My mind swirled a bit when I first read this at Anne’s place and I’m still thinkin’ about it:","parent":"posts/time and place.md","score":0.8181750131868115},{"content":"So. Need to carry on and make the best of my time.","parent":"posts/in the mundane.md","score":0.8168505113244686},{"content":"“When one part of America hurts, we all hurt.”","parent":"posts/we all hurt.md","score":0.8161176727597835},{"content":"a dip in cold water after days in the rough looking directly at the sun new days new ways to think about the same old things bugging me i wait for the chill to take over again and again","parent":"posts/stop-making-sense-part-one.md","score":0.8154255018606459},{"content":"it dawns on me that the caps were killed by a new medium that understood the lack of structure in peoples’ minds helplessly hoping for something new helplessly lost in the din of the same old thing being said over and over and over again in new and different ways","parent":"posts/‘webstream’ revisited.md","score":0.813395872515588},{"content":"those things we wish for","parent":"posts/fleeting.md","score":0.811520061090343},{"content":"\"You'll see...things will be better in Florida.\"","parent":"posts/running.md","score":0.8103425310171217},{"content":"I want to deal with what’s possible, not wallow is what’s already taken place and left its ugly mark.","parent":"posts/chasing thought.md","score":0.808464524852238},{"content":"The thing about repressed memories is that they never really go away.","parent":"posts/shatters.md","score":0.8041990382930255},{"content":"Apparently _those people_ aren’t really people. They’re like monsters getting ready to invade our country and rape our children. That’s the crap Donald’s been feeding people and millions are eating it up. Our country’s in a bit of a mess right now. I regret I was speechless at the time.","parent":"posts/time and place.md","score":0.8040926357525311}]}